In [1]:
# github.com/echtr

In [2]:
import numpy as np
import pandas as pd

In [3]:
m = np.random.randint(1,30, size =(10, 3))
df = pd.DataFrame(m, columns = ["v1","v2","v3"])
df

   v1  v2  v3
0  19  28  20
1  22  15  23
2   6  27  18
3  20  23  22
4   3  22  27
5   4  10  14
6  17  17   4
7   6   8  21
8  13  26   2
9   4  16  27

In [5]:
# loc yapısı tanımlandığı şekli ile seçer
df.loc[:3] # [0. satır: 3. satır]

   v1  v2  v3
0  19  28  20
1  22  15  23
2   6  27  18
3  20  23  22

In [6]:
df.loc[3:5]

   v1  v2  v3
3  20  23  22
4   3  22  27
5   4  10  14

In [10]:
# iloc ise alışık olduğumuz indexleme yöntemini kullanır
df.iloc[:3] # [0. satır: 3. satır)

   v1  v2  v3
0  19  28  20
1  22  15  23
2   6  27  18

In [12]:
df.iloc[:3,:2] # satır ve sütun

   v1  v2
0  19  28
1  22  15
2   6  27

In [14]:
df.loc[:, "v1"] # v1 isimli sütunun tamamını seç

0    19
1    22
2     6
3    20
4     3
5     4
6    17
7     6
8    13
9     4
Name: v1, dtype: int32

In [17]:
df.loc[3:5, "v2"] # --a1

3    23
4    22
5    10
Name: v2, dtype: int32

In [18]:
df.iloc[0:3, 1:3]

   v2  v3
0  28  20
1  15  23
2  27  18

In [20]:
# --a1'deki aynı kullanım df.iloc[3:, "v2"] şeklinde yapılamaz. string şeklinde kullanım loc'a ait. bu yüzden iloc için 
# şu şekilde bir yöntem var
df.iloc[:3]["v2"]

0    28
1    15
2    27
Name: v2, dtype: int32